import img111 from "@assets/result/111.png";
import img000 from "@assets/result/000.png";
import img001 from "@assets/result/001.png";
import img011 from "@assets/result/011.png";
import img010 from "@assets/result/010.png";
import img100 from "@assets/result/100.png";
import img110 from "@assets/result/110.png";
import img101 from "@assets/result/101.png";

const result = new Map();

result.set("111", {
  img: img111,
  title: "热情的追踪者",
  desc: "猎手侦探",
  text: `<p>你是一名充满激情的线索猎手，热衷于以推理的方式解开谜题的谜底。</p> <p>对于你来说，每一个未解之谜都是一次引人入胜的冒险，而推理过程则成为你挑战智力极限的机会。</p> <p>你的冷静头脑和洞察力使你在迷雾笼罩的情境中脱颖而出，一步一步揭示谜团的真相。</p> <p>你的激情不仅体现在解谜上，也在分享和探讨中，你总是乐于与他人分享你的见解和经验，让你成为一个备受欢迎的智慧之旅的领袖。</p>`,
});

result.set("101", {
  img: img101,
  title: "乐观的舞者",
  desc: "电波游侠",
  text: `<p>你是一位充满激情的线索猎手，但与常规的推理不同，你更倾向于利用高超的技术手段直接解锁谜题的答案。</p>
<p>你不满足于仅仅推测，而是通过数字足迹、网络追踪和黑客技能等工具，以独特而高效的方式找到线索的源头。</p>
<p>你的电子精通让你能够在数字世界中畅游，寻找答案并揭示真相。</p>
<p>你的热情不仅仅体现在寻找答案上，还表现在对技术挑战的执着追求，将你塑造成一位充满创意和技术魅力的线索探险家。</p>`,
});

result.set("110", {
  img: img110,
  title: "决绝的孤狼",
  desc: "暗影解密者",
  text: `<p>你是一名独自行动的线索猎手，热衷于以推理为武器，解锁谜题的答案。</p>
<p>孤独的道路是你的选择，你享受着在安静的时刻思考和解决问题的机会。</p>
<p>你的冷静和洞察力让你在孤独中更加坚定，每一次谜题的挑战都成为你自我探索和成长的契机。</p>
<p>你的独立性和独特的洞见使你成为一个孤狼探险家，不断追求着谜题背后的真相，无论环境多么艰难。</p>`,
});

result.set("100", {
  img: img100,
  title: "冷酷的独行者",
  desc: "幽影代码师",
  text: `<p>你是一名独来独往的线索猎手，与众不同的是，你更倾向于独立运用技术手段来直接获取谜题的答案。</p>
<p>孤独的探险道路是你的选择，你享受着独自掌握数字工具和技术来解锁问题的满足感。</p>
<p>你的技术娴熟，让你能够在数字世界中独立行动，寻找线索并揭示谜团的真相。</p>
<p>你的独立性和创新精神使你成为一个寻找答案的孤胆探险家，无论面对多么复杂的挑战，都能够应对自如。</p>`,
});

result.set("011", {
  img: img011,
  title: "睿智的观察者",
  desc: "智谋侦探",
  text: `<p>你是一位充满激情的谜题探长，热衷于通过深入推理来揭示谜题的答案。你视每个谜题为挑战，而推理是你的利剑。</p>
<p>你的才智和逻辑思考能力使你能够解开看似棘手的谜题，每次成功都是一场知识的胜利。</p>
<p>你不断追求智力刺激，而每个解密过程都是你的探险，带你进入充满谜团的世界，挑战你的思维极限。</p>
<p>你的激情在每个解谜过程中熠熠生辉，成为解谜社区中备受尊敬的谜题大师。</p>`,
});

result.set("001", {
  img: img001,
  title: "创造性的奇才",
  desc: "思维解码师",
  text: `<p>你是一位充满激情的谜题探长，不同寻常的是，你更倾向于以技术手段来直接解锁谜题的答案。</p>
<p>你的探险之路注重实用性，通过高超的技术技能，你能够快速获取线索并解开复杂的谜题。</p>
<p>你的独特方法不仅是一次技术挑战，也是对问题的精妙解答。</p>
<p>你将信息和技术视为你的武器，以此引领着解谜领域的未来，成为备受瞩目的技术推动者，谜题的先知。</p>`,
});

result.set("000", {
  img: img000,
  title: "沉静的隐士",
  desc: "寂夜思考者",
  text: `<p>你是一名独自行动的谜题探长，与众不同的是，你更倾向于利用技术手段来直接获取谜题的答案。</p>
<p>孤独的道路是你的选择，你在自己的数字领域里独立行动，寻找线索并揭示谜题的真相。</p>
<p>你的技术娴熟使你能够迅速解开复杂谜题，将谜团还原为明晰的信息片段。</p>
<p>你的独立性和创新精神使你成为一个孤胆探险家，无论面对多么复杂的挑战，都能以自己的方式找到答案，成为谜题解密的高手。</p>`,
});

result.set("010", {
  img: img010,
  title: "刚毅的求真者",
  desc: "谜雾探索者",
  text: `<p>你是一名独行的谜题探长，对于解谜而言，你更偏爱用推理的智慧来获取答案。</p>
<p>孤独的探索是你的标志，你享受独自思考，深入研究每一个谜题。</p>
<p>你的洞察力和冷静思考的能力使你能够深入挖掘每个线索，将看似无关的信息拼凑成完整的图像。</p>
<p>在孤独的探索中，你不仅仅发现答案，还发现了自己的内在力量。你是一个自信而独立的谜题大师，永不妥协，总是坚定地追求真相。</p>`,
});

result.set("-1", {
  desc: "旁观者",
  text: `<p>作为旁观者，你可以通过观察其他玩家的行为和互动来获得有关游戏的信息，并从中推断出他们可能会做出的下一步行动。</p>
<p>Lookers-on see most of the game. 旁观者清。</p>
<p>或许下次可以试着成为一个参与到游戏里的玩家？也许有不一样的体验！</p>`,
});

export default result;
